Retrieve all the curveLoops of FootPrintRoof.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public ModelCurveArrArray GetProfiles()
  Visual Basic
Public Function GetProfiles As ModelCurveArrArray
  Visual C++
public:
ModelCurveArrArray^ GetProfiles()
 See Also
  FootPrintRoof Class
  Autodesk.Revit.DB Namespace